"""
У меня есть четыре положительных целых числа: A, B, C и D, где A < B < C < D.
Входные данные представляют собой список целых чисел A, B, C, D, AxB, BxC, CxD,
DxA в некотором порядке. Ваша задача — вернуть значение D.
"""


def alphabet(ns: list[int]) -> int:
    """
    Поиск значения D.
    """
    return next((x for x in sorted(set(ns))[3:6] if x * min(ns) in ns), 0)


def test() -> None:
    """
    Тестирование работы алгоритмов.
    """
    data = (
        ([2, 3, 4, 1, 12, 6, 2, 4], 4),
        ([2, 6, 7, 3, 14, 35, 15, 5], 7),
        ([20, 10, 6, 5, 4, 3, 2, 12], 5),
        ([2, 6, 18, 3, 6, 7, 42, 14], 7),
        ([7, 96, 8, 240, 12, 140, 20, 56], 20),
        ([20, 30, 6, 7, 4, 42, 28, 5], 7),
        ([528, 684, 2, 22572, 33, 1368, 16, 32], 684),
    )
    for key, val in data:
        assert alphabet(key) == val


if __name__ == '__main__':
    test()
