"""
Задание 5 первой недели ASC (средний уровень #2)

Создайте функцию, которая принимает на вход двумерный массив и выдает на выходе другой массив,
содержащий средние значения чисел во вложенных массивах по соответствующим индексам.

Примечание: функция должна работать также с отрицательными числами и числами с плавающей запятой.
Примеры

[ [1, 2, 3, 4], [5, 6, 7, 8] ]  ==>  [3, 4, 5, 6]

1st array: [1, 2, 3, 4]
2nd array: [5, 6, 7, 8]
            |  |  |  |
            v  v  v  v
average:   [3, 4, 5, 6]

И ещё один:

[ [2, 3, 9, 10, 7], [12, 6, 89, 45, 3], [9, 12, 56, 10, 34], [67, 23, 1, 88, 34] ]  ==>  [22.5, 11, 38.75, 38.25, 19.5]

1st array: [  2,   3,    9,   10,    7]
2nd array: [ 12,   6,   89,   45,    3]
3rd array: [  9,  12,   56,   10,   34]
4th array: [ 67,  23,    1,   88,   34]
              |    |     |     |     |
              v    v     v     v     v
average:   [22.5, 11, 38.75, 38.25, 19.5]

"""
import unittest
from typing import Any, Callable, List, Tuple


def avg_array(arrs: List[List[int | float]]) -> List[float]:
    """
    Вычисляет среднее значение элементов списка, расположенных под одинаковыми индексами.
    """
    return [sum(x) / len(x) for x in zip(*arrs)]


def test(func: Callable[[Any], Any], data: Tuple[Tuple[Any, Any], ...]) -> None:
    """Тестирование работы алгоритмов с помощью unittest."""

    def test_func(func: Callable[[Any], Any], key: Any, val: Any) -> Callable[[Any], Any]:
        """Создает кейсы для тестирования."""
        return lambda self: self.assertEqual(func(key), val)

    funcs = {f'test_{i}': test_func(func, key, val) for i, (key, val) in enumerate(data, 1)}
    suite = unittest.TestLoader().loadTestsFromTestCase(type('Tests', (unittest.TestCase,), funcs))

    unittest.TextTestRunner().run(suite)


if __name__ == '__main__':
    test(avg_array, (
        (([[1, 2, 3, 4], [5, 6, 7, 8]]), [3, 4, 5, 6]),
        (([[2, 3, 9, 10, 7], [12, 6, 89, 45, 3], [9, 12, 56, 10, 34], [67, 23, 1, 88, 34]]), [22.5, 11, 38.75, 38.25, 19.5]),
        (([[2, 5, 4, 3, 19], [2, 5, 6, 7, 10]]), [2, 5, 5, 5, 14.5]),
        (([[1.2, 8.521, 0.4, 3.14, 1.9], [2, 4.5, 3.75, 0.987, 1.0]]), [1.6, 6.5105, 2.075, 2.0635, 1.45]),
        (([[2, 5, -4, 3, -19], [-2, -5, 6, 7, 10]]), [0, 0, 1, 5, -4.5]),
        (([[-2, -18, -45, -10], [0, -45, -20, -34]]), [-1, -31.5, -32.5, -22]),
    ))
