"""
Убедитесь, что два предоставленных массива содержат одинаковое количество разных уникальных
элементов независимо от порядка. Например, в следующем:

[a,a,a,a,b,b] and [c,c,c,d,c,d]

Оба массива содержат четыре элемента одного и два элемента другого,
поэтому баланс должен вернуться True.
"""

from operator import eq
from collections import Counter


def balance(arr1: list, arr2: list) -> bool:
    """
    Проверяет, что два предоставленных массива содержат одинаковое количество разных
    уникальных элементов независимо от порядка.
    """
    return eq(*[sorted(Counter(x).values()) for x in (arr1, arr2)])


def test() -> None:
    """
    Тестирование работы алгоритмов.
    """
    data = (
        (
            (
                ["a", "a", "a", "a", "a", "b", "b", "b"],
                ["c", "c", "c", "c", "c", "d", "d", "d"],
            ), True,
        ),
        (
            (
                ["a", "a"],
                ["c"],
            ), False,
        ),
        (
            (

                ["a", "b", "c", "d", "e", "f", "g", "g"],
                ["h", "h", "i", "j", "k", "l", "m", "n"],
            ), True,
        ),
        (
            (

                ["a"],
                ["c"],
            ), True,
        ),
        (
            (

                ["a", "b", "c", "d", "e", "f", "g", "g"],
                ["h", "h", "i", "j", "k", "l", "m", "m"],
            ), False,
        ),
    )
    for key, val in data:
        assert balance(*key) == val


if __name__ == '__main__':
    test()
