"""
Пятничный вечер, и Чаку скучно. Он уже пробежал 1000 миль, останавливаясь лишь
для того, чтобы съесть большую упаковку чипсов Heatwave Doritos и большую горсть
M&M's. Он просто не может перестать думать о том, как бы что-нибудь пнуть!

Остается только одно: Чак отправляется в местный зал смешанных единоборств и тут
же бросает вызов каждому бойцу, чтобы тот зашел в клетку и попытался повалить его...
ОДНОВРЕМЕННО!

Вам предоставляется массив строк, представляющих клетку и противников Чака. Ваша
задача, в традиционном стиле Чака, — оторвать им головы! Наносите удары руками,
ногами, головой (или, что более вероятно, используйте регулярное выражение или итерацию...),
но что бы вы ни делали, оторвите им головы. Возвращает тот же массив строк, но без голов ( 'O') и заменив их пробелом ( ' ').

Если предоставленный массив пуст или представляет собой пустую строку, верните "Gym is empty".
Если указано целое число, верните "This isn't the gym!!".

ДРАТЬСЯ!!
"""
import typing
import unittest


def head_smash(arr: list[str] | str | int) -> list[str] | str:
    """
    Заменяет символы в строке списка.
    """
    return 'This isn\'t the gym!!' if isinstance(arr, int) else arr and [x.replace('O', ' ') for x in arr] or 'Gym is empty'


def test(func: typing.Callable, data: tuple[tuple[typing.Any, typing.Any]]) -> None:
    """Тестирование работы алгоритмов с помощью unittest."""

    def test_func(func: typing.Callable, key: typing.Any, val: typing.Any) -> typing.Callable:
        """Создает кейсы для тестирования."""
        return lambda self: self.assertEqual(func(key), val)

    funcs = {f'test_{i}': test_func(func, key, val) for i, (key, val) in enumerate(data, 1)}
    suite = unittest.TestLoader().loadTestsFromTestCase(type('Tests', (unittest.TestCase,), funcs))

    unittest.TextTestRunner().run(suite)


if __name__ == '__main__':
    test(head_smash, (
        (
        [
        '*****************************************',
        '**  _O_   *   _O_   *   _O_   *   _O_  **',
        '** /(.)J  *  C(.)J  *  /(.)J  *  C(.)J **',
        '** _| |_  *  _| |_  *  _( )_  *  _( )_ *'],
        [
        '*****************************************',
        '**  _ _   *   _ _   *   _ _   *   _ _  **',
        '** /(.)J  *  C(.)J  *  /(.)J  *  C(.)J **',
        '** _| |_  *  _| |_  *  _( )_  *  _( )_ *']),
        (
        [
        '***  _O_   **   _O_   **   _O_   **   _O_  ***',
        '*** /(.)J  **  /(.)J  **  C(.)J  **  C(.)J ***',
        '*** _| |_  **  _| |_  **  _| |_  **  _( )_ **'],
        [
        '***  _ _   **   _ _   **   _ _   **   _ _  ***',
        '*** /(.)J  **  /(.)J  **  C(.)J  **  C(.)J ***',
        '*** _| |_  **  _| |_  **  _| |_  **  _( )_ **']),
        (
        [
        '*****************************************',
        '***********   _O_   *   _O_   ***********',
        '**  _O_   *  /(.)J  *  /(.)J  *   _O_  **',
        '** /(.)J  *  _| |_  *  _( )_  *  /(.)J **',
        '** _( )_  *********************  _( )_ **',
        '******************* X ******************'],
        [
        '*****************************************',
        '***********   _ _   *   _ _   ***********',
        '**  _ _   *  /(.)J  *  /(.)J  *   _ _  **',
        '** /(.)J  *  _| |_  *  _( )_  *  /(.)J **',
        '** _( )_  *********************  _( )_ **',
        '******************* X ******************']),
        (
        [
        '*****************************************',
        '***********   _O_   *   _O_   ***********',
        '**  _O_   *  C(.)J  *  /(.)J  *   _O_  **',
        '** /(.)J  *  _| |_  *  _/ )_  *  C(.)J **',
        '** _/ )_  *********************  _/ |_ **',
        '******************* X *******************',
        '**********************  _O_  ************',
        '**  _O_   *   _O_   *  /(.)J  *   _O_  **',
        '** /(.)J  *  C(.)J  *  _/ )_  *  C(.)J **',
        '** _( )_  *  _| |_  ***********  _/ |_ **',
        '****************************************'],
        [
        '*****************************************',
        '***********   _ _   *   _ _   ***********',
        '**  _ _   *  C(.)J  *  /(.)J  *   _ _  **',
        '** /(.)J  *  _| |_  *  _/ )_  *  C(.)J **',
        '** _/ )_  *********************  _/ |_ **',
        '******************* X *******************',
        '**********************  _ _  ************',
        '**  _ _   *   _ _   *  /(.)J  *   _ _  **',
        '** /(.)J  *  C(.)J  *  _/ )_  *  C(.)J **',
        '** _( )_  *  _| |_  ***********  _/ |_ **',
        '****************************************']),
        ([],'Gym is empty'),
        (876,'This isn\'t the gym!!'),
        ('','Gym is empty'),
        (6,'This isn\'t the gym!!'),
        (509876251,'This isn\'t the gym!!'),
        (11111111111,'This isn\'t the gym!!'),
    ))
