"""
Функция принимает двумерный квадратный массив случайных целых чисел.
На главной диагонали все отрицательные целые числа необходимо заменить на 0,
а остальные необходимо заменить на 1 (Примечание: 0(здесь считается неотрицательным).

( Вы можете изменять входные данные, если хотите, но лучше этого не делать .)

Пример:

Входной массив

[
  [-1,  4, -5, -9,  3 ],
  [ 6, -4, -7,  4, -5 ],
  [ 3,  5,  0, -9, -1 ],
  [ 1,  5, -7, -8, -9 ],
  [-3,  2,  1, -5,  6 ]
]

Выходной массив

[
  [ 0,  4, -5, -9,  3 ],
  [ 6,  0, -7,  4, -5 ],
  [ 3,  5,  1, -9, -1 ],
  [ 1,  5, -7,  0, -9 ],
  [-3,  2,  1, -5,  1 ]
]
"""
import unittest
from typing import Any, Callable, List, Tuple


def matrix(array: List[List[int]]) -> List[List[int]]:
    """
    Производит замену на главной диагонали.
    """
    return [[[val, 1 - (val < 0)][x == y] for y, val in enumerate(line)] for x, line in enumerate(array)]


def test(func: Callable[[Any], Any], data: Tuple[Tuple[Any, Any], ...]) -> None:
    """Тестирование работы алгоритмов с помощью unittest."""

    def test_func(func: Callable[[Any], Any], key: Any, val: Any) -> Callable[[Any], Any]:
        """Создает кейсы для тестирования."""
        return lambda self: self.assertEqual(func(key), val)

    funcs = {f'test_{i}': test_func(func, key, val) for i, (key, val) in enumerate(data, 1)}
    suite = unittest.TestLoader().loadTestsFromTestCase(type('Tests', (unittest.TestCase,), funcs))

    unittest.TextTestRunner().run(suite)


if __name__ == '__main__':
    test(matrix, (
        (
            [[-1, 4, -5, -9, 3],
             [6, -4, -7, 4, -5],
             [3, 5, 4, -9, -1],
             [1, 5, -7, -8, -9],
             [-3, 2, 1, -5, 6]],

            [[0, 4, -5, -9, 3],
             [6, 0, -7, 4, -5],
             [3, 5, 1, -9, -1],
             [1, 5, -7, 0, -9],
             [-3, 2, 1, -5, 1]]
        ),

        (
            [[-1, 4, -5, -9, 3],
             [6, 8, -7, 4, -5],
             [3, 5, 1, -9, -1],
             [1, 5, -7, 15, -9],
             [-3, 2, 1, -5, -6]],

            [[0, 4, -5, -9, 3],
             [6, 1, -7, 4, -5],
             [3, 5, 1, -9, -1],
             [1, 5, -7, 1, -9],
             [-3, 2, 1, -5, 0]]
        ),

        (
            [[-1, 4, -5, -9, 3, 8],
             [6, 8, -7, 4, -5, -1],
             [3, 5, 1, -9, -1, 6],
             [1, 5, -7, 15, -9, 3],
             [-3, 2, 1, -5, -6, 0],
             [8, 2, 0, -2, 4, -5]],

            [[0, 4, -5, -9, 3, 8],
             [6, 1, -7, 4, -5, -1],
             [3, 5, 1, -9, -1, 6],
             [1, 5, -7, 1, -9, 3],
             [-3, 2, 1, -5, 0, 0],
             [8, 2, 0, -2, 4, 0]]
        ),
        (
            [[1, 1, -5, 5],
             [2, -4, 11, 2],
             [3, 1, -1, 4],
             [2, -6, 8, 10]],

            [[1, 1, -5, 5],
             [2, 0, 11, 2],
             [3, 1, 0, 4],
             [2, -6, 8, 1]],
        ),
    ))
