"""
Обзор

Поле вот-вот будет разделено на 4 равные части двумя перпендикулярными дорогами,
проходящими через центр.

Поле представлено прямоугольной сеткой целых чисел,
где каждое число обозначает стоимость земельного участка.
Задача

Дана сетка area( list[list[int]]),
возвращает максимальную общую стоимость земли среди четырех участков.

Любой участок земли, занятый дорогами, не является частью какого-либо участка .

    При нестандартных размерах средний ряд/колонка заняты дорогами.
    Для обеспечения равномерных размеров дороги проходят между двумя средними рядами/колоннами.

Примечания

    Гарантируется, что сетка будет прямоугольной.
    Входные ограничения: 2 <= grid rows, grid columns <= 100
    Значения могут быть отрицательными.

Пример

1. [[4,6,7,2],          4 6 | 7 2
    [0,3,7,6],    =>    0 3 | 7 6
    [7,9,4,2],          ----+-----
    [1,1,2,0]]          7 9 | 4 2
                        1 1 | 2 0
                        
    Output : 22 (7+2+7+6)
    
2. [[0,0,3,4,1],        0 0 | 4 1
    [6,8,9,1,4],        6 8 | 1 4
    [9,0,3,6,1],   =>   ----+----
    [8,2,4,6,3],        8 2 | 6 3
    [1,6,3,7,8]]        1 6 | 7 8
        
    Output : 24 (6+3+7+8)
    
3. [[2,5,1,0,4,5],      2 5 1 | 0 4 5
    [5,6,8,1,3,0],      5 6 8 | 1 3 0
    [5,9,1,3,7,4],  =>  ------+------
    [8,9,1,2,4,5],      8 9 1 | 2 4 5
    [3,5,7,0,1,2]]      3 5 7 | 0 1 2
    
    Output : 33 (8+9+1+3+5+7)

"""
import unittest
from typing import Any, Callable, List, Tuple


def max_land_value(area: List[List[int]]) -> int:
    """
    Определяет касимальную стоимость среди 4-х групп участков.
    """
    x, y, res = len(area) // 2, len(area[0]) // 2, [0] * 4
    for i, line in enumerate(area):
        for j, n in enumerate(line):
            if len(area) % 2 and i == x or len(line) % 2 and j == y:
                continue
            res[(i >= x and 2) + (j >= y)] += n
    return max(res)


def test(func: Callable[[Any], Any], data: Tuple[Tuple[Any, Any], ...]) -> None:
    """Тестирование работы алгоритмов с помощью unittest."""

    def test_func(func: Callable[[Any], Any], key: Any, val: Any) -> Callable[[Any], Any]:
        """Создает кейсы для тестирования."""
        return lambda self: self.assertEqual(func(key), val)

    funcs = {f'test_{i}': test_func(func, key, val) for i, (key, val) in enumerate(data, 1)}
    suite = unittest.TestLoader().loadTestsFromTestCase(type('Tests', (unittest.TestCase,), funcs))

    unittest.TextTestRunner().run(suite)


if __name__ == '__main__':
    test(max_land_value, (
        ([[5, 6],
            [1, 3]], 6),

        ([[0, 0],
            [2, 2]], 2),

        ([[4, 5, 6, 1],
          [1, 2, 4, 0],
          [9, 0, 3, 2],
          [1, 2, 3, 4]], 12),

        ([[-1, 4, 7, -2],
          [0, 6, 7, -2],
            [8, 10, 1, -5],
          [1, -6, 7, 7]], 13),

        ([[4, 5, 1, 0, 5, 6],
          [1, 6, 1, 7, 0, 0],
          [0, 0, 0, 0, 0, 0],
          [1, 2, 3, 4, 5, 6],
          [6, 7, 5, 4, 1, 0],
          [1, 0, 0, 2, 4, 6]], 32),

        ([[4, -1, 5, 7, 8, -6],
          [-2, 6, 8, 1, 2, 9],
          [2, 7, -3, 6, 1, 0],
          [0, 0, 3, 3, -1, -1],
          [4, 6, 10, 4, 5, 7],
          [-2, 5, 7, 9, 1, 2]], 33),

        ([[1, 2, 3, 4],
          [4, 1, 3, 2]], 7),

        ([[8, 1],
          [1, 7],
          [9, 0],
          [5, 6]], 14),

        ([[1, 5, 6, 8, 1, 0],
          [0, -1, 5, 8, -2, 0],
          [1, 2, 5, -3, 6, 7],
          [0, 0, 2, 7, 0, 3]], 20),

        ([[1, 2, 6, 0],
          [1, 8, 0, 9],
          [5, 6, 8, 1],
          [0, 0, 2, 2],
          [1, 1, 3, 9],
          [9, 9, 5, 6]], 27),

        ([[6, 7],
          [9, 9],
          [-1, -6],
          [2, 5],
            [0, -3],
          [6, 2],
          [0, 3],
          [3, 1],
          [0, 2],
          [-4, 2]], 16),

        ([[6, 6, 6, 6, 6, 2, 3, 0, 0, 2, 4, 3],
          [7, 7, 7, 2, 5, 3, 0, 9, 3, 4, 1, 3]], 32),

        ([[0, 6, 0],
            [9, 8, 9],
            [0, 2, 0]], 0),

        ([[6, 5, 2],
            [7, 9, 1],
            [1, 7, 5]], 6),

        ([[1, 3, 5, 8, 0],
            [8, 9, 0, 0, 9],
            [5, 5, 5, 5, 5],
            [0, 5, 2, 4, 6],
            [1, 2, 8, 3, 4]], 21),

        ([[-1, -5, -8, -2, -1],
            [0, 2, 9, -1, 2],
            [5, 9, 9, 4, -9],
            [-3, -1, 9, 2, -7],
            [2, -4, -7, -5, 9]], -1),

        ([[0, 9, 0, 1, 2, 3, 4],
            [5, 7, 1, 6, 9, 0, 4],
            [0, 5, 7, 1, 1, 1, 1],
            [0, 6, 7, 8, 9, 0, 2],
            [8, 7, 3, 4, 5, 1, 2],
            [2, 1, 5, 3, 7, 8, 9],
            [5, 6, 8, 1, 2, 9, 0]], 45),

        ([[1, 4, 0, 0, 0, 0, 0],
            [-1, 4, 2, 3, 1, 0, 1],
            [3, -2, 4, 1, -2, 5, 1],
            [-2, 5, 1, 8, 1, 5, 6],
            [-1, 3, 2, 0, 2, 3, -2],
            [0, 5, 1, 2, 0, -2, 4],
            [1, 1, 1, 1, 1, 1, 1]], 15),

        ([[1, 2, 3, 4, 5],
            [5, 1, 2, 4, 3],
            [1, 2, 5, 4, 2]], 9),

        ([[3, 1, 4],
            [1, 4, 2],
            [0, -2, 5],
            [1, 1, 1],
            [0, 7, 2]], 6),

        ([[1, 5, 7, 1, 2, 3, 0],
            [0, 2, 3, 4, 1, 5, 6],
            [0, 0, 2, 3, 4, 5, 9],
            [1, 2, 6, 9, 0, 2, 4],
            [5, 6, 7, 9, 0, 1, 2]], 27),

        ([[1, 0, 2, 3, 7],
            [2, 6, 7, 0, 2],
            [4, 5, 6, 8, 9],
            [2, 5, 8, 9, 0],
            [1, 2, 6, 8, 9],
            [0, 9, 2, 3, 1],
            [1, 8, 4, 2, 3]], 29),

        ([[2, 3, 5],
          [0, 4, 2],
          [9, 0, 2],
          [0, 4, 6],
          [0, 0, 0],
          [7, 0, 4],
          [1, 2, 7],
          [5, 9, 2],
          [0, 5, 7]], 20),

        ([[5, 6, 1, 0, -2, 5, 9, 9, -8, 5, 1, 2, 4],
            [6, 8, 2, -6, 2, 9, 9, 9, 9, 9, 1, -6, 0],
            [-9, -9, 0, 3, 5, 6, 9, 9, 2, -6, 1, 5, 3]], 15),

        ([[1, 3, 0],
          [1, 4, 1]], 1),

        ([[2, 1],
          [0, 5],
            [1, 2],
            [2, 3],
            [4, 0]], 6),

        ([[1, 5, 2, 3, 4, 7, 6],
          [6, 4, 3, 7, 1, 2, 5]], 17),

        ([[3, 4, 4],
          [2, 1, 6],
            [0, 1, 8],
            [2, 3, 1]], 10),

        ([[3, 4, 5, 1, 2, 0],
          [2, 3, 1, 0, 0, 2],
            [-1, 4, 2, 0, 0, -2]], 12),

        ([[-1, 3, 5, -2],
          [0, 7, 2,  0],
            [0, 4, 5,  5],
            [1, 4, 2, -3],
            [2, 3, 3,  5]], 10),

        ([[3, 1, 2, 5, 6, 0, 1],
          [0, 0, 2, 1, 3, 4, 5],
            [9, 8, 2, 1, 0, 5, 6],
            [0, 0, 2, 1, 5, 6, 7]], 29),

        ([[5, 8, 9, 1, 2],
          [0, 2, -3, 6, 5],
            [1, 1, 1, 1, 1],
            [0, 3, 4, 2, 6],
            [6, 1, 2, 4, 1],
            [8, 3, 4, 2, 1]], 21),

        ([[6, 4, 1, 2, -3, 2, 1],
          [-5, 2, 1, 5, 6, 7, 1],
          [-3, 6, 1, 3, -5, 3, 1],
            [9, 3, 1, 2, 0, 0, 8],
            [-6, 4, 3, 1, 6, 3, 2],
          [2, 1, 0, 8, -3, 6, 2]], 24),

        ([[0, 0, 0, 0, 0, 0, 0, 0],
          [0, 0, 0, 0, 0, 0, 0, 2],
            [0, 0, 0, 0, 0, 0, 0, 0],
            [9, 9, 9, 9, 9, 9, 9, 9],
            [1, 0, 0, 0, 0, 0, 2, 0],
            [0, 0, 0, 0, 0, 0, 0, 0],
          [0, 0, 0, 0, 0, 0, 0, 0]], 2),

        ([[1, 2, 3, 1, 2, 0, 3, 4, 5, 7, 0, 1, 2, 3, 4, 8, 0, 0, 1],
          [4, 0, 0, 1, 2, 3, 1, 2, 3, 9, 0, 1, 2, 5, 0, 1, 1, 6, 7]], 23),
    ))
