"""
Напишите алгоритм, который берет массив и перемещает все нули в конец, сохраняя порядок остальных
элементов.

move_zeros([1, 0, 1, 2, 0, 1, 3]) # returns [1, 1, 2, 1, 3, 0, 0]

"""


def move_zeros(lst: list) -> list:
    """
    Перемещает все 0 из списка в его конец, сохраняя остальную последовательность.
    """
    return [x for x in lst if x] + [0] * lst.count(0)


def test() -> None:
    """
    Тестирование работы алгоритмов.
    """
    data = (
        (
            [1, 2, 0, 1, 0, 1, 0, 3, 0, 1],
            [1, 2, 1, 1, 3, 1, 0, 0, 0, 0],
        ),
        (
            [9, 0, 0, 9, 1, 2, 0, 1, 0, 1, 0, 3, 0, 1, 9, 0, 0, 0, 0, 9],
            [9, 9, 1, 2, 1, 1, 3, 1, 9, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        ),
    )
    for key, val in data:
        assert move_zeros(key) == val


if __name__ == '__main__':
    test()
