"""
Ваша задача — создать таблицу умножения N x N размера,
указанного в параметре.

Например, когда дано N это 3:

1 2 3
2 4 6
3 6 9

Для данного примера возвращаемое значение должно быть:

[[1,2,3],[2,4,6],[3,6,9]]
"""


def multiplication_table(n: int) -> list:
    """
    Построение таблицы умножения указанных размеров.
    """
    return [list(range(i, i * n + 1, i)) for i in range(1, n + 1)]


def test() -> None:
    """
    Тестирование работы алгоритмов.
    """
    data = (
        (1, [[1]]),
        (2, [[1, 2], [2, 4]]),
        (3, [[1, 2, 3], [2, 4, 6], [3, 6, 9]]),
        (4, [[1, 2, 3, 4], [2, 4, 6, 8], [3, 6, 9, 12], [4, 8, 12, 16]]),
        (5, [[1, 2, 3, 4, 5], [2, 4, 6, 8, 10], [3, 6, 9, 12, 15],
             [4, 8, 12, 16, 20], [5, 10, 15, 20, 25]]),
    )
    for key, val in data:
        assert multiplication_table(key) == val


if __name__ == '__main__':
    test()
