"""
Дан треугольник из последовательных нечетных чисел:

             1
          3     5
       7     9    11
   13    15    17    19
21    23    25    27    29
...

найдите строку треугольника, зная его индекс (строки имеют индекс 1), например:

odd_row(1)  ==  [1]
odd_row(2)  ==  [3, 5]
odd_row(3)  ==  [7, 9, 11]

Примечание.
Ваш код должен быть оптимизирован для обработки больших входных данных.
"""


def odd_row(n: int) -> list[int]:
    """
    Определяет строку треугольника по его индексу.
    """
    return [n ** 2 - n + 1 + x * 2 for x in range(n)]


def test() -> None:
    """
    Тестирование работы алгоритмов.
    """
    data = (
        (1, [1]),
        (2, [3, 5]),
        (13, [157, 159, 161, 163, 165, 167, 169, 171, 173, 175, 177, 179, 181]),
        (19, [343, 345, 347, 349, 351, 353, 355, 357, 359, 361, 363, 365, 367, 369, 371, 373, 375, 377, 379]),
        (41, [1641, 1643, 1645, 1647, 1649, 1651, 1653, 1655, 1657, 1659, 1661, 1663, 1665, 1667, 1669, 1671, 1673, 1675, 1677, 1679, 1681, 1683, 1685, 1687, 1689, 1691, 1693, 1695, 1697, 1699, 1701, 1703, 1705, 1707, 1709, 1711, 1713, 1715, 1717, 1719, 1721]),
    )
    for key, val in data:
        assert odd_row(key) == val


if __name__ == '__main__':
    test()
