"""
Задание и правила

Дает вам массив arrНайдите число, содержащее несколько элементов. peaks и
valleysв массиве и вернуть их.

Что означают пики и впадины? Если элемент больше, чем три элемента слева и больше,
чем три элемента справа, мы называем его peakНапротив, элемент, значение которого
меньше значения трех элементов (левого и правого), называется . valley. пример:

[10,20,30,40,30,20,10,11,12,13,14,15,16,15,14,13]

В приведенном выше примере пики и впадины — это:

[10,20,30,40,30,20,10,11,12,13,14,15,16,15,14,13]

[         40   ,   10        ,       16         ]

Несколько примеров:

[10,20,30,40,30,20,10,11,12,13,14,15,16,15,14,13]
=> [40,10,16]

[50,84,49,47,80,87,87,53,76,30,10]
=> [47]

[45,94,41,76,29,96,28,13,84,69,25]
=> [96,13]

[1,16,63,78,53,78,42,39,46,88,49,96,58,82]
=> [39]

[45,75,47,44,93,95,31,99,49,48,76,2,92,23,26,19,60,45,51]
=> [31,99,2,92,19]

[49,97,76,56,96,88,65,20,14,93,32]
=> []
"""
import unittest
from typing import Any, Callable, List, Tuple


def peak_and_valley(arr: List[int], x: int = 3) -> List[int]:
    """
    Определяет пиковые значения.
    """
    res = []
    for i, n in enumerate(arr):
        if i >= x and i < len(arr) - x:
            tmp = {}
            for lst in (arr[i-x:i][::-1], arr[i+1:i+1+x]):
                k = set()
                for v in lst:
                    k.add([[None, 0][n > v], 1][n < v])
                tmp[len(k) == 1] = tmp.get(len(k) == 1, set()).union(k)
            if len(tmp) == 1 and len(tmp.get(1, set())) == 1:
                res.append(n)
    return res


def peak_and_valley_2(arr: List[int]) -> List[int]:
    """
    Определяет пиковые значения.
    """
    return [x[3] for x in zip(*[arr[i:] for i in range(7)]) if x[3] < min(x[:3] + x[-3:]) or x[3] > max(x[:3] + x[-3:])]


def test(func: Callable[[Any], Any], data: Tuple[Tuple[Any, Any], ...]) -> None:
    """Тестирование работы алгоритмов с помощью unittest."""

    def test_func(func: Callable[[Any], Any], key: Any, val: Any) -> Callable[[Any], Any]:
        """Создает кейсы для тестирования."""
        return lambda self: self.assertEqual(func(key), val)

    funcs = {f'test_{i}': test_func(func, key, val) for i, (key, val) in enumerate(data, 1)}
    suite = unittest.TestLoader().loadTestsFromTestCase(type('Tests', (unittest.TestCase,), funcs))

    unittest.TextTestRunner().run(suite)


if __name__ == '__main__':
    test(peak_and_valley, (
        ([10, 20, 30, 40, 30, 20, 10, 11, 12, 13, 14, 15, 16, 15, 14, 13], [40, 10, 16]),
        ([50, 84, 49, 47, 80, 87, 87, 53, 76, 30, 10], [47]),
        ([45, 94, 41, 76, 29, 96, 28, 13, 84, 69, 25], [96, 13]),
        ([1, 16, 63, 78, 53, 78, 42, 39, 46, 88, 49, 96, 58, 82], [39]),
        ([45, 75, 47, 44, 93, 95, 31, 99, 49, 48, 76, 2, 92, 23, 26, 19, 60, 45, 51], [31, 99, 2, 92, 19]),
        ([49, 97, 76, 56, 96, 88, 65, 20, 14, 93, 32], []),
    ))

    test(peak_and_valley_2, (
        ([10, 20, 30, 40, 30, 20, 10, 11, 12, 13, 14, 15, 16, 15, 14, 13], [40, 10, 16]),
        ([50, 84, 49, 47, 80, 87, 87, 53, 76, 30, 10], [47]),
        ([45, 94, 41, 76, 29, 96, 28, 13, 84, 69, 25], [96, 13]),
        ([1, 16, 63, 78, 53, 78, 42, 39, 46, 88, 49, 96, 58, 82], [39]),
        ([45, 75, 47, 44, 93, 95, 31, 99, 49, 48, 76, 2, 92, 23, 26, 19, 60, 45, 51], [31, 99, 2, 92, 19]),
        ([49, 97, 76, 56, 96, 88, 65, 20, 14, 93, 32], []),
    ))
