"""
Вес каждого восклицательного знака равен 2; вес каждого вопросительного знака равен 3.
Соединение двух строк leftи rightна балансе - они сбалансированы?

Если левая сторона более тяжелая, верните "Left";
если правая сторона тяжелее, вернитесь "Right";
если они сбалансированы, верните "Balance".

Примеры
"!!", "??"     -->  "Right"
"!??", "?!!"   -->  "Left"
"!?!!", "?!?"  -->  "Left"
"!!???!????", "??!!?!!!!!!!"  -->  "Balance"
"""


def balance(left: str, right: str) -> str:
    """
    Определение баланса строк, учитывая вес символа.
    """
    a, b = [sum([2, 3][n == '?'] for n in x) for x in (left, right)]
    return {a > b: 'Left', a < b: 'Right'}.get(1, 'Balance')


def test() -> None:
    """
    Тестирование работы алгоритмов.
    """
    data = (
        (("", ""), "Balance"),
        (("!!", "??"), "Right"),
        (("!??", "?!!"), "Left"),
        (("!?!!", "?!?"), "Left"),
        (("!!???!????", "??!!?!!!!!!!"), "Balance"),
    )
    for key, val in data:
        assert balance(*key) == val


if __name__ == '__main__':
    test()
