"""
Учитывая время в классе формата времени, вернуть его без года, месяца и дня.
Он должен возвращать строку, включающую миллисекунды с 3 десятичными знаками.
"""

from datetime import datetime


def convert(time: datetime) -> str:
    """Преобразование даты и времени во время с миллисекундами с точностью в 3 знака."""
    return time.strftime('%H:%M:%S,%f')[:12]


def test() -> None:
    """Тестирование работы алгоритмов."""

    data = (
        ((2016, 2, 8, 16, 42, 59), "16:42:59,000"),
        ((1, 1, 1, 1, 1, 1, 110000), "01:01:01,110"),
        ((1850, 12, 30, 13, 39, 19), "13:39:19,000"),
        ((1978, 3, 18, 12, 0, 0, 0), "12:00:00,000"),
        ((1523, 5, 29, 23, 2, 2, 9000), "23:02:02,009"),
        ((9999, 9, 9, 9, 9, 9, 999999), "09:09:09,999"),
        ((2, 12, 30, 23, 59, 59, 875939), "23:59:59,875"),
        ((1850, 12, 30, 0, 0, 0, 321939), "00:00:00,321"),
        ((1951, 10, 31, 2, 2, 24, 399000), "02:02:24,399"),
        ((1850, 12, 30, 11, 11, 11, 123939), "11:11:11,123"),
    )

    for key, val in data:
        assert convert(datetime(*key)) == val


if __name__ == '__main__':
    test()
