"""
Построить башню

Постройте башню в форме пирамиды как массив/список строк,
заданный положительным целым числом. number of floors.
Многоквартирный дом представлен "*"характер.

Например, башня с 3полы выглядят так:

[
  "  *  ",
  " *** ", 
  "*****"
]

И башня с 6полы выглядят так:

[
  "     *     ", 
  "    ***    ", 
  "   *****   ", 
  "  *******  ", 
  " ********* ", 
  "***********"
]

"""


def tower_builder(n: int) -> list[str]:
    """
    Создает построчно башню заданной высоты.
    """
    return [('*' * (2 * (i + 1) - 1)).center(2 * n - 1) for i in range(n)]


def test() -> None:
    """
    Тестирование работы алгоритмов.
    """
    data = (
        (1, ['*', ]),
        (2, [' * ', '***']),
        (3, ['  *  ', ' *** ', '*****']),
    )
    for key, val in data:
        assert tower_builder(key) == val


if __name__ == '__main__':
    test()
