"""
Суммирование простых чисел

Сумма простых чисел, не превышающих 10, равна 2 + 3 + 5 + 7 = 17 .
Найдите сумму всех простых чисел, указанных ниже или равных числу, переданному в N.

Из задачи Эйлера №10 .
"""


def summation_of_primes(n: int) -> int:
    """
    Сумма простых чисел не превышающих N.
    """
    return [0, 2][n > 1] + sum(x for x in range(3, n + 1, 2) if next((0 for n in range(3, int(x ** .5 + 1), 2) if not x % n), 1))


def test() -> None:
    """
    Тестирование работы алгоритмов.
    """
    data = (
        (1, 0),
        (2, 2),
        (5, 10),
        (6, 10),
        (7, 17),
        (8, 17),
        (9, 17),
        (10, 17),
        (20, 77),
        (30, 129),
        (40, 197),
        (50, 328),
        (100, 1060),
        (200, 4227),
        (300, 8275),
        (400, 13887),
        (500, 21536),
    )
    for key, val in data:
        assert summation_of_primes(key) == val


if __name__ == '__main__':
    test()
